# Do it Pandas 공부
## Date : 2020-09-28_ Day2_1

In [1]:
import pandas as pd

In [2]:
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

In [3]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'])
s

0         Wes McKinney
1    Creator of Pandas
dtype: object

In [4]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'], index=['Person', 'Who'])
s

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [5]:
sci = pd.DataFrame({
    'name' : ['Rosaline Franklin', 'William Gosset'],
    'occupation' : ['Chemist', 'Statistician'],
    'born' : ['1920-07-25', '1876-06-13'],
    'died' : ['1958-04-16', '1937-10-16'],
    'age' : [37, 61]
})
sci

                name    occupation        born        died  age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [6]:
data = {'name' : ['Rosaline Franklin', 'William Gosset'],
    'occupation' : ['Chemist', 'Statistician'],
    'born' : ['1920-07-25', '1876-06-13'],
    'died' : ['1958-04-16', '1937-10-16'],
    'age' : [37, 61]}

In [7]:
sci = pd.DataFrame(data, index=['Rosaline Franklin', 'William Gosset'], columns = ['occupation','born', 'age', 'died'])

In [8]:
sci

                     occupation        born  age        died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

In [9]:
sci = pd.DataFrame(data, index=['Rosaline Franklin', 'William Gosset'], columns = ['occupation','born', 'died', 'age'])

In [10]:
first_row = sci.loc['William Gosset']

In [11]:
first_row

occupation    Statistician
born            1876-06-13
died            1937-10-16
age                     61
Name: William Gosset, dtype: object

In [12]:
first_row.index

Index(['occupation', 'born', 'died', 'age'], dtype='object')

In [13]:
first_row.values

array(['Statistician', '1876-06-13', '1937-10-16', 61], dtype=object)

In [14]:
first_row.keys()

Index(['occupation', 'born', 'died', 'age'], dtype='object')

In [18]:
sci = pd.read_csv('./doit_pandas-master/doit_pandas-master/data/scientists.csv')

In [19]:
sci

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [20]:
ages = sci['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [21]:
ages.max()

90

In [22]:
ages.mean()

59.125

In [23]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [24]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [25]:
ages + pd.Series([1, 100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [26]:
sci[sci['Age'] > sci['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [27]:
sci['Born'].dtype

dtype('O')

In [28]:
born_datetime = pd.to_datetime(sci['Born'], format='%Y-%m-%d')
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [29]:
died_datetime = pd.to_datetime(sci['Died'], format='%Y-%m-%d')

In [30]:
sci['born_dt'], sci['died_dt'] = (born_datetime, died_datetime)

In [31]:
sci

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [32]:
sci.shape

(8, 7)

In [33]:
sci['age_days_dt'] = sci['died_dt'] - sci['born_dt']

In [34]:
sci

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [35]:
import random

In [38]:
random.seed(42)
random.shuffle(sci['Age'])
sci['Age']

0    61
1    41
2    66
3    56
4    37
5    45
6    77
7    90
Name: Age, dtype: int64

In [39]:
sci.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

In [40]:
sci.drop(['age_days_dt'], axis=1, inplace=True)

In [41]:
sci

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,61,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,41,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,66,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,56,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,37,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,77,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,90,Mathematician,1777-04-30,1855-02-23

In [42]:
names = sci['Name']
names.to_pickle('./sci_names_series.pickle')

In [43]:
sci.to_pickle('./sci_df.pickle')

In [44]:
pd.read_pickle('./sci_names_series.pickle')

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object